<unk>	0
<s>	0
</s>	0
in	-0
at	-1
er	-2
re	-3
▁t	-4
▁*	-5
);	-6
▁{	-7
▁}	-8
st	-9
on	-10
ad	-11
ata	-12
▁=	-13
if	-14
▁/	-15
▁/*	-16
▁*/	-17
se	-18
ce	-19
or	-20
data	-21
le	-22
▁c	-23
▁p	-24
lo	-25
ar	-26
de	-27
▁b	-28
en	-29
▁th	-30
ing	-31
int	-32
▁n	-33
▁data	-34
pt	-35
oo	-36
al	-37
ed	-38
▁(	-39
▁#	-40
()	-41
as	-42
am	-43
ut	-44
▁I	-45
ood	-46
ion	-47
an	-48
good	-49
▁s	-50
▁C	-51
▁if	-52
▁w	-53
ch	-54
cept	-55
▁f	-56
et	-57
▁the	-58
ine	-59
▁good	-60
it	-61
xcept	-62
▁re	-63
ro	-64
St	-65
▁e	-66
ec	-67
Line	-68
is	-69
▁pr	-70
uf	-71
ass	-72
fer	-73
uffer	-74
ll	-75
put	-76
▁st	-77
("	-78
In	-79
");	-80
▁v	-81
ur	-82
ream	-83
▁F	-84
▁"	-85
ader	-86
▁print	-87
IT	-88
ile	-89
Re	-90
▁O	-91
();	-92
MIT	-93
▁OMIT	-94
ic	-95
AL	-96
IO	-97
ry	-98
id	-99
▁a	-100
ink	-101
log	-102
▁printLine	-103
Buffer	-104
wor	-105
oid	-106
def	-107
WE	-108
est	-109
ve	-110
ull	-111
word	-112
assword	-113
▁u	-114
char	-115
IN	-116
▁void	-117
▁in	-118
end	-119
ect	-120
and	-121
▁null	-122
▁except	-123
Stream	-124
putStream	-125
ck	-126
▁ne	-127
▁CWE	-128
es	-129
▁P	-130
EN	-131
▁0	-132
▁bad	-133
▁to	-134
endif	-135
ate	-136
mp	-137
ase	-138
iz	-139
▁o	-140
ENT	-141
▁m	-142
xception	-143
Exception	-144
Sink	-145
ock	-146
ring	-147
▁h	-148
▁is	-149
▁ch	-150
▁i	-151
un	-152
UL	-153
GO	-154
AD	-155
▁exceptIO	-156
ode	-157
ey	-158
all	-159
row	-160
▁password	-161
ver	-162
10	-163
ocket	-164
▁int	-165
▁IO	-166
rypt	-167
our	-168
ource	-169
OD	-170
ndef	-171
lose	-172
onn	-173
onnect	-174
NUL	-175
atic	-176
ifndef	-177
!=	-178
ue	-179
▁new	-180
arg	-181
ble	-182
urn	-183
InputStream	-184
LA	-185
ize	-186
ror	-187
..	-188
__	-189
GOOD	-190
BAD	-191
li	-192
▁IN	-193
sing	-194
▁OMITBAD	-195
▁OMITGOOD	-196
",	-197
LAW	-198
▁FLAW	-199
ort	-200
▁!=	-201
▁goodG	-202
▁be	-203
NULL	-204
te	-205
low	-206
▁char	-207
▁use	-208
il	-209
logg	-210
ay	-211
Le	-212
Key	-213
▁test	-214
ain	-215
Reader	-216
AR	-217
vel	-218
ct	-219
▁reader	-220
ss	-221
Level	-222
ser	-223
OT	-224
100	-225
▁T	-226
ot	-227
▁S	-228
ING	-229
2_	-230
▁L	-231
Buffered	-232
▁r	-233
▁In	-234
onnection	-235
Er	-236
Error	-237
▁static	-238
atch	-239
File	-240
IAL	-241
▁POT	-242
ENTIAL	-243
▁POTENTIAL	-244
▁catch	-245
able	-246
ARN	-247
WARN	-248
logger	-249
WARNING	-250
ID	-251
xt	-252
▁try	-253
of	-254
case	-255
cl	-256
get	-257
su	-258
om	-259
▁INC	-260
▁FI	-261
▁for	-262
▁imp	-263
String	-264
ation	-265
ent	-266
[]	-267
lass	-268
";	-269
iti	-270
clu	-271
clude	-272
▁import	-273
ig	-274
▁0;	-275
▁<	-276
alue	-277
lic	-278
KE	-279
▁NULL	-280
ace	-281
▁D	-282
IOException	-283
▁throw	-284
ST	-285
▁FIX	-286
.");	-287
▁de	-288
▁arg	-289
▁and	-290
ill	-291
▁Th	-292
include	-293
▁buffer	-294
wchar	-295
▁main	-296
▁source	-297
▁H	-298
lse	-299
▁wh	-300
va	-301
▁throws	-302
▁not	-303
▁j	-304
ash	-305
em	-306
rom	-307
ak	-308
ti	-309
▁ret	-310
▁se	-311
rit	-312
list	-313
▁else	-314
▁stream	-315
ava	-316
▁return	-317
▁java	-318
Socket	-319
▁l	-320
ith	-321
ame	-322
OC	-323
close	-324
cess	-325
▁on	-326
ary	-327
ip	-328
ub	-329
ish	-330
ublic	-331
▁size	-332
▁clo	-333
▁closing	-334
▁an	-335
Fin	-336
▁will	-337
▁public	-338
itial	-339
ign	-340
▁5	-341
▁wchar	-342
()");	-343
▁d	-344
▁with	-345
eck	-346
alling	-347
▁testcase	-348
...");	-349
ished	-350
Calling	-351
()...");	-352
Finished	-353
reak	-354
▁break	-355
▁A	-356
iv	-357
pp	-358
▁Throw	-359
▁Throwable	-360
▁code	-361
ne	-362
▁&	-363
ENTAL	-364
▁INCID	-365
▁INCIDENTAL	-366
ment	-367
▁that	-368
▁==	-369
Ret	-370
OR	-371
▁from	-372
KET	-373
OCKET	-374
oint	-375
Return	-376
ws	-377
[100	-378
▁read	-379
'\	-380
reader	-381
Pro	-382
▁File	-383
pace	-384
▁-	-385
BufferedReader	-386
Crypt	-387
▁string	-388
▁String	-389
vi	-390
rite	-391
ER	-392
32_	-393
let	-394
▁U	-395
Len	-396
listen	-397
Input	-398
FileInput	-399
▁run	-400
qu	-401
';	-402
DE	-403
ject	-404
ead	-405
▁of	-406
bject	-407
▁nam	-408
'\0	-409
'\0';	-410
32	-411
ivate	-412
lt	-413
▁Re	-414
Connection	-415
erm	-416
▁BufferedReader	-417
▁InputStream	-418
load	-419
ccess	-420
ag	-421
password	-422
ist	-423
AT	-424
];	-425
25	-426
▁value	-427
espace	-428
▁namespace	-429
▁using	-430
rue	-431
▁used	-432
Un	-433
▁co	-434
ES	-435
))	-436
flow	-437
verflow	-438
ermin	-439
ive	-440
61	-441
▁below	-442
▁Code	-443
▁as	-444
By	-445
ql	-446
▁sizeof	-447
vice	-448
Data	-449
are	-450
Con	-451
ointer	-452
-1	-453
Hash	-454
Int	-455
ifdef	-456
▁never	-457
write	-458
\\	-459
▁termin	-460
lete	-461
▁561	-462
▁Dead	-463
sult	-464
ray	-465
▁private	-466
▁1	-467
ess	-468
▁en	-469
())	-470
bad	-471
cp	-472
▁);	-473
her	-474
_0	-475
reate	-476
▁Use	-477
MA	-478
vlet	-479
do	-480
Sql	-481
▁exceptSql	-482
▁by	-483
1()	-484
dSink	-485
BufferdSink	-486
FileInputSink	-487
InputStreamSink	-488
tes	-489
ex	-490
itialize	-491
andle	-492
▁reading	-493
▁dataBuffer	-494
ra	-495
andom	-496
User	-497
▁file	-498
atement	-499
UT	-500
crypt	-501
rep	-502
test	-503
ard	-504
sp	-505
▁or	-506
per	-507
tt	-508
Value	-509
Class	-510
igned	-511
io	-512
ool	-513
VAL	-514
_1	-515
3_	-516
source	-517
fo	-518
▁readerBuffered	-519
lib	-520
▁100	-521
ttp	-522
ys	-523
▁when	-524
▁larg	-525
▁fa	-526
to	-527
2()	-528
▁connection	-529
4_	-530
ding	-531
▁tool	-532
rand	-533
.*	-534
rary	-535
12	-536
len	-537
signed	-538
▁str	-539
CWE	-540
oded	-541
ipe	-542
age	-543
SOCKET	-544
▁fi	-545
▁close	-546
std	-547
name	-548
▁delete	-549
▁comp	-550
.*;	-551
▁Read	-552
define	-553
me	-554
wo	-555
▁0,	-556
Ser	-557
▁FileInputStream	-558
▁It	-559
rect	-560
onse	-561
sponse	-562
▁bin	-563
▁compil	-564
cv	-565
MAIN	-566
▁random	-567
Handle	-568
▁W	-569
LO	-570
▁k	-571
und	-572
LE	-573
testcase	-574
add	-575
time	-576
PR	-577
▁seed	-578
uil	-579
▁tools	-580
▁mem	-581
▁it	-582
ound	-583
LU	-584
[])	-585
LUDE	-586
alys	-587
ness	-588
▁argc	-589
▁argv	-590
▁buil	-591
alysis	-592
▁srand	-593
▁binary	-594
LUDEMAIN	-595
unsigned	-596
▁testing	-597
▁analysis	-598
▁building	-599
▁testcases	-600
▁randomness	-601
▁INCLUDEMAIN	-602
quest	-603
▁0)	-604
writeLine	-605
xed	-606
IC	-607
▁B	-608
▁are	-609
1();	-610
pr	-611
sure	-612
Bytes	-613
),	-614
ally	-615
ERR	-616
ERROR	-617
▁we	-618
read	-619
new	-620
True	-621
ayload	-622
▁Initialize	-623
VALID	-624
▁INVALID	-625
ich	-626
Servlet	-627
▁socket	-628
alse	-629
▁fin	-630
socket	-631
indo	-632
5)	-633
▁this	-634
▁Close	-635
▁goodB	-636
));	-637
ction	-638
▁con	-639
▁may	-640
ap	-641
stan	-642
ly	-643
▁class	-644
AN	-645
ack	-646
▁key	-647
▁'\0';	-648
-8	-649
UTF	-650
ATIC	-651
ated	-652
coded	-653
text	-654
++	-655
▁than	-656
indows	-657
0]	-658
inked	-659
ator	-660
6_	-661
yst	-662
▁finally	-663
nt	-664
ld	-665
▁object	-666
▁fixed	-667
Prov	-668
CryptProv	-669
CO	-670
itializ	-671
Ben	-672
Benign	-673
aData	-674
▁recv	-675
▁"";	-676
IV	-677
uct	-678
2();	-679
pec	-680
ath	-681
error	-682
▁check	-683
▁sink	-684
lace	-685
od	-686
▁_	-687
List	-688
5_	-689
static	-690
Ch	-691
▁which	-692
ystem	-693
oss	-694
ossi	-695
OV	-696
▁ser	-697
(1	-698
Set	-699
▁SOCKET	-700
Source	-701
listenSocket	-702
SA	-703
inkedList	-704
set	-705
Create	-706
YP	-707
CON	-708
addr	-709
sink	-710
mall	-711
ipher	-712
[100]	-713
▁le	-714
STATIC	-715
Returns	-716
▁dest	-717
▁small	-718
▁input	-719
hKey	-720
++)	-721
SE	-722
cpy	-723
Test	-724
▁overflow	-725
stream	-726
-1]	-727
rray	-728
rev	-729
▁+	-730
Cont	-731
CONST	-732
rol	-733
▁ho	-734
==	-735
ared	-736
Result	-737
omain	-738
(!	-739
service	-740
▁Class	-741
wn	-742
ossible	-743
▁error	-744
[100];	-745
connect	-746
▁at	-747
9_	-748
og	-749
hCryptProv	-750
▁but	-751
file	-752
RYP	-753
RYPT	-754
ccept	-755
ardcoded	-756
op	-757
▁ensure	-758
▁do	-759
Overflow	-760
▁su	-761
siti	-762
sitive	-763
lean	-764
ily	-765
Pipe	-766
▁large	-767
▁service	-768
iled	-769
unction	-770
());	-771
▁own	-772
▁badsink	-773
WIN	-774
ove	-775
ServletRe	-776
ttpServletRe	-777
fore	-778
Statement	-779
ari	-780
[0]	-781
▁1;	-782
QL	-783
▁failed	-784
().	-785
▁objects	-786
orrect	-787
▁response	-788
Control	-789
SH	-790
roper	-791
GON	-792
▁ex	-793
Name	-794
up	-795
▁[]	-796
▁Possible	-797
AES	-798
▁user	-799
▁init	-800
cs	-801
Ints	-802
woInts	-803
UE	-804
SQL	-805
SQLException	-806
emp	-807
ero	-808
so	-809
bal	-810
lobal	-811
Case	-812
Access	-813
▁lib	-814
")	-815
-8");	-816
▁Ab	-817
CRYPT	-818
IP	-819
gets	-820
▁so	-821
ET	-822
au	-823
Unch	-824
ecked	-825
Unchecked	-826
Not	-827
KEY	-828
En	-829
▁before	-830
==5)	-831
▁ext	-832
bConnection	-833
Array	-834
mpt	-835
Reg	-836
▁terminator	-837
He	-838
Mod	-839
▁hardcoded	-840
▁temp	-841
void	-842
ccessf	-843
ule	-844
Module	-845
uld	-846
->	-847
stanti	-848
▁Instanti	-849
▁vari	-850
repared	-851
reparedStatement	-852
▁wcs	-853
NotF	-854
NotFound	-855
ret	-856
▁successf	-857
Object	-858
crypted	-859
▁ws	-860
▁avoid	-861
▁payload	-862
▁out	-863
size	-864
Five	-865
ory	-866
oot	-867
global	-868
False	-869
▁app	-870
pport	-871
readLine	-872
ure	-873
▁library	-874
▁one	-875
retKey	-876
WOR	-877
ave	-878
FIV	-879
FIVE	-880
array	-881
PROV	-882
AND	-883
Base	-884
Based	-885
ext	-886
System	-887
support	-888
ully	-889
▁successfully	-890
▁can	-891
itialized	-892
dex	-893
ANDLE	-894
ReturnsTrue	-895
Process	-896
ruct	-897
▁exit	-898
▁crypt	-899
Pointer	-900
▁linkedList	-901
loc	-902
cceptSocket	-903
▁was	-904
▁Crypt	-905
Out	-906
Heap	-907
move	-908
▁its	-909
hHash	-910
[5	-911
ationException	-912
sin	-913
IntLine	-914
▁printIntLine	-915
ends	-916
IPE	-917
▁cre	-918
▁array	-919
uth	-920
▁compiler	-921
sultSet	-922
▁goodsource	-923
▁username	-924
Spec	-925
AA	-926
▁recvResult	-927
One	-928
▁only	-929
(1);	-930
Cipher	-931
▁how	-932
woIntsClass	-933
ere	-934
▁eas	-935
RL	-936
▁applic	-937
▁application	-938
DEF	-939
1_	-940
Init	-941
▁wsaData	-942
▁dbConnection	-943
▁easily	-944
RE	-945
ract	-946
stract	-947
TestCase	-948
stractTestCase	-949
vers	-950
▁testcasesupport	-951
▁all	-952
gal	-953
lle	-954
▁Be	-955
From	-956
Pare	-957
args	-958
▁Ille	-959
▁args	-960
▁pack	-961
Parent	-962
▁Below	-963
▁tested	-964
▁Illegal	-965
▁extends	-966
▁package	-967
▁mainFrom	-968
▁compiling	-969
▁ClassNotFound	-970
▁IllegalAccess	-971
▁mainFromParent	-972
▁hash	-973
▁statement	-974
FIN	-975
▁while	-976
la	-977
▁errors	-978
Path	-979
▁>	-980
qui	-981
▁passwordLen	-982
cpp	-983
122_	-984
▁javax	-985
▁listen	-986
retKeySpec	-987
▁Sink	-988
▁inititialized	-989
Check	-990
!");	-991
▁terminate	-992
ast	-993
RUE	-994
Function	-995
oKey	-996
sizeof	-997
Inc	-998
▁CloseHandle	-999
▁point	-1000
▁strlen	-1001
▁Connection	-1002
Li	-1003
Lib	-1004
Library	-1005
▁'	-1006
replace	-1007
80	-1008
FINAL	-1009
▁domain	-1010
Incorrect	-1011
253_	-1012
-1);	-1013
tempt	-1014
▁LO	-1015
ong	-1016
lear	-1017
▁al	-1018
▁request	-1019
▁sec	-1020
▁LOGON	-1021
ty	-1022
▁NUL	-1023
▁tempClass	-1024
▁Sec	-1025
▁Create	-1026
*)	-1027
CP	-1028
ative	-1029
sole	-1030
ome	-1031
ensitive	-1032
SI	-1033
▁pointer	-1034
[10	-1035
Sensitive	-1036
▁delet	-1037
ang	-1038
util	-1039
▁have	-1040
AM	-1041
quire	-1042
US	-1043
Info	-1044
ogon	-1045
ogonUser	-1046
31	-1047
TE	-1048
Tra	-1049
anf	-1050
canf	-1051
versal	-1052
Traversal	-1053
252_	-1054
▁deleted	-1055
▁10	-1056
▁rep	-1057
erb	-1058
eros	-1059
erberos	-1060
',	-1061
ESS	-1062
riter	-1063
TRUE	-1064
▁larger	-1065
▁name	-1066
▁un	-1067
▁HCRYPT	-1068
Ref	-1069
Password	-1070
ree	-1071
exist	-1072
getws	-1073
▁fail	-1074
▁index	-1075
▁fill	-1076
▁6	-1077
▁case	-1078
Be	-1079
▁root	-1080
ties	-1081
8_	-1082
▁N	-1083
▁-1	-1084
▁Password	-1085
Imp	-1086
win	-1087
ting	-1088
▁get	-1089
Proper	-1090
▁true	-1091
Unable	-1092
▁HANDLE	-1093
Tx	-1094
319_	-1095
Clear	-1096
Cleartext	-1097
"";	-1098
atalog	-1099
ALSE	-1100
base	-1101
http	-1102
Pr	-1103
ecrypt	-1104
ant	-1105
▁TwoIntsClass	-1106
▁PIPE	-1107
mem	-1108
▁val	-1109
next	-1110
ern	-1111
▁com	-1112
ernal	-1113
▁Socket	-1114
pHandle	-1115
payload	-1116
[100-1]	-1117
(&	-1118
▁PR	-1119
acceptSocket	-1120
out	-1121
opy	-1122
▁g	-1123
▁tcp	-1124
▁Set	-1125
ri	-1126
WORD	-1127
INET	-1128
▁sock	-1129
▁sockaddr	-1130
foo	-1131
()).	-1132
print	-1133
▁HttpServletRe	-1134
▁2	-1135
ning	-1136
irect	-1137
▁memset	-1138
fgets	-1139
▁could	-1140
▁0);	-1141
▁M	-1142
MOD	-1143
▁non	-1144
windows	-1145
ASH	-1146
connectSocket	-1147
:\\	-1148
64_	-1149
HttpServletRe	-1150
ants	-1151
logging	-1152
ener	-1153
▁replace	-1154
als	-1155
[50	-1156
Auth	-1157
locate	-1158
wsaData	-1159
▁wsaDataInit	-1160
▁up	-1161
intOne	-1162
aram	-1163
Two	-1164
▁*)	-1165
▁console	-1166
▁The	-1167
ause	-1168
▁Al	-1169
Kerberos	-1170
ery	-1171
▁clean	-1172
Windows	-1173
▁no	-1174
ute	-1175
▁Allocate	-1176
user	-1177
▁intPointer	-1178
essage	-1179
Char	-1180
▁variants	-1181
▁&&	-1182
▁path	-1183
erive	-1184
for	-1185
Ex	-1186
printf	-1187
(),	-1188
RC	-1189
ma	-1190
Nam	-1191
agma	-1192
Named	-1193
▁comment	-1194
NamedPipe	-1195
esCipher	-1196
roperties	-1197
hing	-1198
▁created	-1199
temp	-1200
ook	-1201
servlet	-1202
pragma	-1203
ken	-1204
Context	-1205
▁CryptD	-1206
BAL	-1207
GLO	-1208
GLOBAL	-1209
▁running	-1210
eter	-1211
arameter	-1212
▁load	-1213
▁byte	-1214
pi	-1215
Instan	-1216
Instance	-1217
hModule	-1218
▁hModule	-1219
Struct	-1220
Property	-1221
pecif	-1222
▁wcslen	-1223
RSA	-1224
ded	-1225
ooki	-1226
14_	-1227
▁sw	-1228
256	-1229
ers	-1230
▁Do	-1231
▁Kerberos	-1232
114_	-1233
▁false	-1234
▁En	-1235
bound	-1236
entic	-1237
entication	-1238
To	-1239
RLConnection	-1240
▁database	-1241
▁cryptoKey	-1242
den	-1243
denti	-1244
dentials	-1245
BSink	-1246
▁here	-1247
_4	-1248
OutputStream	-1249
▁def	-1250
▁10;	-1251
net	-1252
▁struct	-1253
▁fgets	-1254
0);	-1255
▁log	-1256
ination	-1257
igest	-1258
▁variable	-1259
itch	-1260
▁switch	-1261
cip	-1262
cipal	-1263
incipal	-1264
AUL	-1265
▁>=	-1266
AULT	-1267
DEFAULT	-1268
fig	-1269
prev	-1270
▁0))	-1271
▁100-1);	-1272
ou	-1273
AC	-1274
ATE	-1275
Authentication	-1276
goodG	-1277
▁login	-1278
cat	-1279
ault	-1280
▁printW	-1281
7_	-1282
string	-1283
▁destination	-1284
▁rever	-1285
▁space	-1286
ph	-1287
ogra	-1288
phic	-1289
ographic	-1290
▁attempt	-1291
Byte	-1292
ORT	-1293
TCP	-1294
PORT	-1295
▁memory	-1296
▁default	-1297
▁resultSet	-1298
passwordLen	-1299
exists	-1300
▁chang	-1301
▁write	-1302
▁printWLine	-1303
roy	-1304
estroy	-1305
▁CryptDestroy	-1306
lient	-1307
▁fla	-1308
ADD	-1309
lease	-1310
AB	-1311
▁over	-1312
▁listener	-1313
▁passwordBuffer	-1314
▁Hash	-1315
▁Ensure	-1316
readerBuffered	-1317
▁any	-1318
▁streamFileInput	-1319
70	-1320
YTE	-1321
▁FILE	-1322
▁hHash	-1323
▁E	-1324
nsitive	-1325
34	-1326
▁std	-1327
39	-1328
ALG	-1329
▁CALG	-1330
AME	-1331
ould	-1332
(100	-1333
rst	-1334
lative	-1335
ond	-1336
txt	-1337
wh	-1338
▁(0);	-1339
▁flaw	-1340
▁This	-1341
▁Hard	-1342
Good	-1343
staticFive	-1344
▁into	-1345
▁badsource	-1346
256,	-1347
_256,	-1348
IVATE	-1349
tain	-1350
▁bytes	-1351
STR	-1352
STRING	-1353
ector	-1354
▁encrypted	-1355
▁hKey	-1356
▁badSource	-1357
toString	-1358
▁initializ	-1359
▁access	-1360
loads	-1361
isFile	-1362
uploads	-1363
▁catalog	-1364
▁set	-1365
▁terminated	-1366
Output	-1367
CESS	-1368
BConnection	-1369
((	-1370
▁least	-1371
▁SRC	-1372
1234	-1373
Next	-1374
Prev	-1375
tr	-1376
▁memcpy	-1377
!=5)	-1378
private	-1379
getBytes	-1380
ron	-1381
Gener	-1382
viron	-1383
vironment	-1384
ANC	-1385
(2	-1386
ABC	-1387
verSocket	-1388
-8"	-1389
Decrypt	-1390
15_	-1391
▁ot	-1392
▁other	-1393
struct	-1394
▁able	-1395
Digest	-1396
essageDigest	-1397
RegCreate	-1398
+1	-1399
Ext	-1400
figur	-1401
Setting	-1402
Configur	-1403
External	-1404
Configuration	-1405
▁some	-1406
istry	-1407
Registry	-1408
▁keyName	-1409
ost	-1410
▁logg	-1411
▁logged	-1412
▁initialize	-1413
ByteArray	-1414
(2,	-1415
Ptr	-1416
▁1)	-1417
th	-1418
pFile	-1419
▁aesCipher	-1420
LOSE	-1421
AAAA	-1422
▁Cipher	-1423
[50-1]	-1424
▁stdin	-1425
_6	-1426
Vector	-1427
work	-1428
▁net	-1429
▁network	-1430
▁Copy	-1431
805_	-1432
▁dataBytes	-1433
▁linkedListNext	-1434
▁linkedListPrev	-1435
getProperty	-1436
lim	-1437
▁CLOSE	-1438
pen	-1439
Mut	-1440
Mutex	-1441
dest	-1442
▁been	-1443
PUT	-1444
intTwo	-1445
▁list	-1446
▁fgetws	-1447
23_	-1448
▁5)	-1449
NET	-1450
IDER	-1451
WORK	-1452
LOGON	-1453
NETWORK	-1454
PROVIDER	-1455
LogonUser	-1456
▁prev	-1457
USKey	-1458
FI	-1459
AY	-1460
▁leak	-1461
Sec	-1462
▁include	-1463
▁tempClassObject	-1464
DEFG	-1465
ABCDEFG	-1466
OF	-1467
▁dataLen	-1468
hPipe	-1469
FALSE	-1470
laint	-1471
laintext	-1472
ReturnsFalse	-1473
scanf	-1474
ileg	-1475
▁see	-1476
ivileg	-1477
▁5;	-1478
Ab	-1479
▁HKEY	-1480
▁closed	-1481
way	-1482
▁-1;	-1483
36_	-1484
hash	-1485
sol	-1486
Absol	-1487
▁100,	-1488
Absolute	-1489
ger	-1490
UF	-1491
▁SecretKeySpec	-1492
▁secretKeySpec	-1493
90	-1494
▁function	-1495
▁closesocket	-1496
▁;	-1497
Domain	-1498
▁long	-1499
Relative	-1500
▁correct	-1501
art	-1502
BSource	-1503
erson	-1504
(1)	-1505
[10+1	-1506
▁smaller	-1507
ber	-1508
Station	-1509
ADDR	-1510
gh	-1511
Improper	-1512
yp	-1513
sa	-1514
▁specif	-1515
ore	-1516
fput	-1517
▁connect	-1518
Generator	-1519
▁To	-1520
▁Pointer	-1521
[0]);	-1522
ted	-1523
▁If	-1524
Of	-1525
Client	-1526
▁Ser	-1527
▁LogonUser	-1528
▁By	-1529
▁690	-1530
▁Value	-1531
pointer	-1532
▁Return	-1533
▁initializing	-1534
ince	-1535
▁since	-1536
um	-1537
▁Con	-1538
▁outbound	-1539
▁ServerSocket	-1540
Release	-1541
dataLen	-1542
HASH	-1543
Des	-1544
INPUT	-1545
umber	-1546
here	-1547
*)&	-1548
Qu	-1549
IST	-1550
ISTEN	-1551
▁listenSocket	-1552
iol	-1553
▁Secure	-1554
ivilege	-1555
fe	-1556
amily	-1557
▁handle	-1558
Map	-1559
getInstance	-1560
Static	-1561
leanup	-1562
home	-1563
getInputStream	-1564
SHA	-1565
CH	-1566
WA	-1567
WAIT	-1568
wins	-1569
ues	-1570
▁values	-1571
▁Windows	-1572
[10];	-1573
request	-1574
Desk	-1575
▁WSA	-1576
MODE	-1577
');	-1578
Hard	-1579
Coded	-1580
▁100;	-1581
▁head	-1582
▁Call	-1583
27	-1584
▁1,	-1585
INST	-1586
▁BUF	-1587
INSTANC	-1588
ity	-1589
▁reversing	-1590
root	-1591
(5	-1592
eriveKey	-1593
ough	-1594
chr	-1595
ookie	-1596
ersonate	-1597
▁(!	-1598
VALUE	-1599
us	-1600
ALL	-1601
▁AF	-1602
▁URLConnection	-1603
safe	-1604
▁enough	-1605
con	-1606
Unsafe	-1607
470	-1608
470_	-1609
recv	-1610
Refle	-1611
Reflection	-1612
recvResult	-1613
▁cause	-1614
url	-1615
2_32	-1616
Long	-1617
▁acceptSocket	-1618
alloc	-1619
▁pipe	-1620
▁MS	-1621
▁attempts	-1622
▁IP	-1623
Start	-1624
▁nothing	-1625
▁writer	-1626
Random	-1627
▁Object	-1628
form	-1629
ttempt	-1630
hashData	-1631
▁KerberosKey	-1632
Cleanup	-1633
cryptoKey	-1634
_2	-1635
tcp	-1636
28	-1637
intPointer	-1638
Ac	-1639
ENH	-1640
▁PROV	-1641
Acquire	-1642
CryptAcquire	-1643
sql	-1644
▁call	-1645
▁first	-1646
_7	-1647
family	-1648
▁payloadBytes	-1649
▁boo	-1650
▁boolean	-1651
staticTrue	-1652
▁allow	-1653
fgetws	-1654
".	-1655
▁neg	-1656
▁valid	-1657
▁changing	-1658
▁negative	-1659
▁pHandle	-1660
KeyEx	-1661
HANDLE	-1662
auth	-1663
ITE	-1664
54	-1665
ized	-1666
▁flow	-1667
▁ab	-1668
init	-1669
▁inser	-1670
dout	-1671
Hex	-1672
line	-1673
OCK	-1674
▁uses	-1675
▁LISTEN	-1676
ATA	-1677
SAD	-1678
ons	-1679
▁ht	-1680
MAKE	-1681
REAM	-1682
[50]	-1683
port	-1684
▁SOCK	-1685
▁WSAD	-1686
STREAM	-1687
▁htons	-1688
Startup	-1689
MAKEWORD	-1690
▁WSADATA	-1691
wsaDataInit	-1692
▁WSACleanup	-1693
Viol	-1694
Violation	-1695
ied	-1696
272_	-1697
NAME	-1698
▁fre	-1699
Least	-1700
Privilege	-1701
lish	-1702
▁Pr	-1703
▁Print	-1704
_3	-1705
▁specified	-1706
▁ResultSet	-1707
CU	-1708
Use	-1709
sec	-1710
val	-1711
valid	-1712
BeDecrypt	-1713
BeDecrypted	-1714
▁sent	-1715
ended	-1716
▁Free	-1717
▁freed	-1718
▁intended	-1719
▁6:	-1720
open	-1721
▁there	-1722
▁wmem	-1723
▁wmemset	-1724
loop	-1725
ab	-1726
HER	-1727
mpty	-1728
true	-1729
▁empty	-1730
▁crypto	-1731
streamFileInput	-1732
Writer	-1733
19	-1734
amp	-1735
ample	-1736
▁Attempt	-1737
▁Key	-1738
stab	-1739
stablish	-1740
else	-1741
▁ERROR	-1742
quired	-1743
▁pFile	-1744
top	-1745
ow	-1746
▁parameter	-1747
ide	-1748
PIPE	-1749
tack	-1750
tacker	-1751
▁attacker	-1752
▁listening	-1753
READ	-1754
toChar	-1755
toCharArray	-1756
ter	-1757
▁direct	-1758
▁ST	-1759
▁EOF	-1760
▁above	-1761
gth	-1762
vapi	-1763
length	-1764
▁fails	-1765
▁statements	-1766
▁hold	-1767
os	-1768
").	-1769
Low	-1770
getD	-1771
Lower	-1772
dexOf	-1773
indexOf	-1774
toLower	-1775
globalFive	-1776
toLowerCase	-1777
▁"/	-1778
woIntsStruct	-1779
ACK	-1780
LOG	-1781
BACK	-1782
BACKLOG	-1783
Bad	-1784
Impersonate	-1785
▁FALSE	-1786
ULE	-1787
oad	-1788
USER	-1789
▁his	-1790
▁HMOD	-1791
▁Load	-1792
▁does	-1793
badSink	-1794
▁loaded	-1795
▁HMODULE	-1796
▁FreeLibrary	-1797
▁LoadLibrary	-1798
▁AES	-1799
encrypted	-1800
sensitive	-1801
Query	-1802
GE	-1803
MES	-1804
▁SH	-1805
SAGE	-1806
▁hPipe	-1807
MESSAGE	-1808
▁credentials	-1809
ED	-1810
sn	-1811
)]	-1812
Parameter	-1813
▁Abort	-1814
▁De	-1815
)*	-1816
▁qu	-1817
▁getting	-1818
CreateProcess	-1819
getDBConnection	-1820
SU	-1821
BYTE	-1822
anag	-1823
▁less	-1824
ecause	-1825
CryptD	-1826
HashData	-1827
CreateHash	-1828
CryptHashData	-1829
CryptDeriveKey	-1830
CryptCreateHash	-1831
lock	-1832
ABCDEFGH	-1833
INT	-1834
host	-1835
99	-1836
verM	-1837
anager	-1838
riverM	-1839
riverManager	-1840
▁Delete	-1841
▁HASH	-1842
▁establish	-1843
ecut	-1844
store	-1845
▁Restore	-1846
▁twoIntsStruct	-1847
▁leave	-1848
redentials	-1849
284_	-1850
fread	-1851
▁calls	-1852
ncpy	-1853
2),	-1854
WSA	-1855
_10	-1856
▁NO	-1857
(2,2),	-1858
WSAStartup	-1859
Or	-1860
ions	-1861
OrFalse	-1862
Encrypt	-1863
Mem	-1864
which	-1865
▁dataGood	-1866
Memory	-1867
advapi	-1868
▁badSink	-1869
ul	-1870
ARR	-1871
izer	-1872
ARRAY	-1873
kenizer	-1874
TwoIntsClass	-1875
/";	-1876
iss	-1877
▁bod	-1878
▁properties	-1879
].	-1880
dataPtr	-1881
ecutable	-1882
SUC	-1883
SUCCESS	-1884
formation	-1885
AF	-1886
OTO	-1887
PROTO	-1888
▁IPPROTO	-1889
▁connectSocket	-1890
NPR	-1891
INTF	-1892
NPRINTF	-1893
urity	-1894
▁lim	-1895
▁limit	-1896
▁100*	-1897
▁G	-1898
▁DB	-1899
▁pro	-1900
▁KEY	-1901
▁Reg	-1902
caten	-1903
hUser	-1904
▁stdout	-1905
catenated	-1906
▁pipeName	-1907
▁concatenated	-1908
ByteArrayOutput	-1909
tempFile	-1910
Principal	-1911
▁DWORD	-1912
▁HCRYPTKEY	-1913
▁HCRYPTHASH	-1914
▁HCRYPTPROV	-1915
▁hCryptProv	-1916
▁CryptRelease	-1917
▁CryptDestroyKey	-1918
[10+1]	-1919
259	-1920
3954	-1921
crypto	-1922
▁without	-1923
▁Decrypt	-1924
806_	-1925
24	-1926
(0	-1927
Could	-1928
▁Derive	-1929
bo	-1930
▁allowing	-1931
arri	-1932
▁carri	-1933
▁carriage	-1934
▁inserted	-1935
\\";	-1936
delete	-1937
_5	-1938
▁System	-1939
ppend	-1940
Copy	-1941
PRIVATE	-1942
▁pointed	-1943
teger	-1944
▁external	-1945
snprintf	-1946
ww	-1947
]);	-1948
buffer	-1949
▁Array	-1950
org	-1951
example	-1952
▁wcscpy	-1953
▁environment	-1954
HCRYPT	-1955
ermiss	-1956
ermissions	-1957
▁PRIVATE	-1958
193_	-1959
▁length	-1960
▁dataBad	-1961
▁sh	-1962
Cryptographic	-1963
eded	-1964
setC	-1965
andbo	-1966
▁port	-1967
author	-1968
Desktop	-1969
▁sandbo	-1970
existent	-1971
▁portion	-1972
▁unvalid	-1973
▁unauthor	-1974
setCatalog	-1975
▁plaintext	-1976
▁sandboxed	-1977
▁validation	-1978
dbConnection	-1979
▁nonexistent	-1980
▁unvalidated	-1981
▁unauthorized	-1982
259_	-1983
▁block	-1984
ined	-1985
ake	-1986
▁make	-1987
▁inputBuffer	-1988
AP	-1989
▁next	-1990
▁memmove	-1991
▁way	-1992
3;	-1993
Read	-1994
▁has	-1995
HashMap	-1996
LinkedList	-1997
urlConnection	-1998
2.	-1999
▁readLine	-2000
ncat	-2001
▁sinks	-2002
Close	-2003
▁permissions	-2004
LogonUserA	-2005
▁const	-2006
▁needed	-2007
by	-2008
dap	-2009
▁STATIC	-2010
▁directly	-2011
Se	-2012
TEST	-2013
fter	-2014
TestKey	-2015
▁CreateNamedPipe	-2016
▁BYTE	-2017
code	-2018
payloadBytes	-2019
-259	-2020
Final	-2021
▁strcpy	-2022
ookies	-2023
doFinal	-2024
Open	-2025
remove	-2026
RegCreateUSKey	-2027
2;	-2028
6)	-2029
FIR	-2030
FLA	-2031
HAT	-2032
FLAG	-2033
HERE	-2034
what	-2035
FIRST	-2036
where	-2037
INSTANCE	-2038
"))	-2039
ClassObject	-2040
▁(100	-2041
▁Coded	-2042
▁dataGoodBuffer	-2043
▁NOT	-2044
URLConnection	-2045
Integer	-2046
putObject	-2047
▁sensitive	-2048
sys	-2049
inet	-2050
class	-2051
▁should	-2052
Th	-2053
▁full	-2054
▁named	-2055
forName	-2056
newInstance	-2057
▁Instantiate	-2058
tempClassObject	-2059
FER	-2060
ACCESS	-2061
termin	-2062
ADDRESS	-2063
RR	-2064
CURR	-2065
(5==5)	-2066
CURRENT	-2067
▁checking	-2068
globalTrue	-2069
ok	-2070
str	-2071
▁SNPRINTF	-2072
DAP	-2073
▁being	-2074
▁prevent	-2075
ype	-2076
Free	-2077
ange	-2078
eroMemory	-2079
▁dataCopy	-2080
41	-2081
ndefined	-2082
▁messageDigest	-2083
After	-2084
▁very	-2085
▁remove	-2086
ecute	-2087
repare	-2088
dataRef	-2089
▁Append	-2090
▁dataRef	-2091
[50];	-2092
credentials	-2093
lement	-2094
▁BUFSI	-2095
dll	-2096
ithout	-2097
ir	-2098
As	-2099
LogonUserW	-2100
WR	-2101
fwrite	-2102
console	-2103
reat	-2104
wscanf	-2105
▁fclose	-2106
▁MessageDigest	-2107
unc	-2108
ify	-2109
irectory	-2110
BeEn	-2111
BeEncrypted	-2112
NE	-2113
\0	-2114
\0",	-2115
memcpy	-2116
reater	-2117
▁bound	-2118
memmove	-2119
▁greater	-2120
▁payloadLen	-2121
FileNotFound	-2122
ep	-2123
ition	-2124
▁dataBadBuffer	-2125
ial	-2126
ence	-2127
▁7	-2128
oto	-2129
▁goto	-2130
▁'\	-2131
▁my	-2132
▁LDAP	-2133
toBeDecrypted	-2134
LongLine	-2135
00	-2136
MP	-2137
ANY	-2138
WRITE	-2139
fscanf	-2140
▁INADDR	-2141
▁accept	-2142
RegOpen	-2143
▁R	-2144
SS	-2145
OL	-2146
2_32")	-2147
winsock	-2148
416_	-2149
rv	-2150
use	-2151
pecify	-2152
winsrv	-2153
▁Specify	-2154
ways	-2155
▁always	-2156
▁)	-2157
▁proper	-2158
LI	-2159
ses	-2160
LIMIT	-2161
//	-2162
://	-2163
1234!	-2164
)-	-2165
_01_	-2166
_02_	-2167
_03_	-2168
_04_	-2169
_05_	-2170
_06_	-2171
_07_	-2172
_08_	-2173
_09_	-2174
_10_	-2175
_11_	-2176
_12_	-2177
_13_	-2178
_14_	-2179
_15_	-2180
_16_	-2181
_17_	-2182
ENAME	-2183
der	-2184
input	-2185
▁KeyGenerator	-2186
_18_	-2187
▁second	-2188
▁tempFile	-2189
▁keyGenerator	-2190
!=5	-2191
==5	-2192
CHAR	-2193
Directory	-2194
96	-2195
terminate	-2196
FILE	-2197
range	-2198
bounds	-2199
▁required	-2200
cc	-2201
(100*	-2202
RLF	-2203
SET	-2204
inate	-2205
▁CRLF	-2206
▁Elim	-2207
▁strchr	-2208
▁wcschr	-2209
▁Eliminate	-2210
▁We	-2211
For	-2212
dition	-2213
▁Aquire	-2214
▁Context	-2215
▁hashData	-2216
▁Properties	-2217
)];	-2218
OCA	-2219
ALLOCA	-2220
1(	-2221
Union	-2222
▁myUnion	-2223
Stack	-2224
llo	-2225
union	-2226
toHex	-2227
3);	-2228
▁outputObject	-2229
(6)	-2230
56	-2231
ht	-2232
32\\	-2233
ight	-2234
▁might	-2235
Testing	-2236
ureRandom	-2237
▁goodsink	-2238
▁principal	-2239
.0	-2240
HAR	-2241
▁CHAR	-2242
strlen	-2243
▁50	-2244
sscanf	-2245
▁50-1);	-2246
ritable	-2247
▁open	-2248
Information	-2249
ies	-2250
Stor	-2251
tainer	-2252
Storage	-2253
)))	-2254
ENER	-2255
ating	-2256
ENERIC	-2257
without	-2258
▁pathname	-2259
cryptoKeyLen	-2260
15	-2261
secure	-2262
32.	-2263
bly	-2264
ossibly	-2265
▁union	-2266
▁Remove	-2267
Fi	-2268
Su	-2269
2(	-2270
spect	-2271
▁cookie	-2272
▁property	-2273
▁decrypted	-2274
bin	-2275
UN	-2276
omet	-2277
▁somet	-2278
▁BUFFER	-2279
▁something	-2280
First	-2281
▁Don	-2282
-8"));	-2283
kerberos	-2284
zero	-2285
▁occ	-2286
▁cryptographic	-2287
arch	-2288
Plaintext	-2289
▁classTwo	-2290
▁anyway	-2291
▁,	-2292
▁4	-2293
REG	-2294
▁lo	-2295
▁cer	-2296
oking	-2297
▁most	-2298
▁certain	-2299
▁looking	-2300
▁checkers	-2301
▁implement	-2302
▁sourceLen	-2303
▁implementation	-2304
};	-2305
▁{0	-2306
▁URL	-2307
lines	-2308
orary	-2309
▁newlines	-2310
▁context	-2311
getConnection	-2312
▁DriverManager	-2313
▁changes	-2314
▁reverses	-2315
properties	-2316
7015	-2317
▁TCP	-2318
2_32.	-2319
▁link	-2320
direct	-2321
▁27015	-2322
▁final	-2323
▁linking	-2324
resultSet	-2325
-8"),	-2326
ready	-2327
▁already	-2328
ENV	-2329
Size	-2330
lect	-2331
select	-2332
execute	-2333
prepare	-2334
executeQuery	-2335
prepareStatement	-2336
Condition	-2337
exit	-2338
connection	-2339
com	-2340
ines	-2341
staticFalse	-2342
▁bey	-2343
▁beyond	-2344
Hello	-2345
1;	-2346
-1),	-2347
eger	-2348
putc	-2349
puts	-2350
▁{0};	-2351
rename	-2352
▁integer	-2353
RegCreateKeyEx	-2354
SHRegCreateUSKey	-2355
▁same	-2356
FileOutput	-2357
▁hashing	-2358
ariable	-2359
lf	-2360
▁0'	-2361
Text	-2362
issing	-2363
121_	-2364
AYLO	-2365
pipe	-2366
pper	-2367
AYLOAD	-2368
▁upper	-2369
▁process	-2370
▁free	-2371
ait	-2372
bind	-2373
▁fopen	-2374
security	-2375
vert	-2376
▁GENERIC	-2377
▁exception	-2378
▁<<	-2379
byte	-2380
Self	-2381
▁bodies	-2382
linkedList	-2383
ress	-2384
▁dataVector	-2385
123456	-2386
ka	-2387
_61	-2388
WHAT	-2389
head	-2390
ured	-2391
▁add	-2392
▁aka	-2393
WHERE	-2394
▁points	-2395
▁address	-2396
▁occured	-2397
dataBytes	-2398
▁LoadLibraryA	-2399
▁LoadLibraryW	-2400
▁encryptedLen	-2401
▁toBeEncrypted	-2402
bas	-2403
basic	-2404
▁order	-2405
[10+1];	-2406
UP	-2407
TYP	-2408
TYPE	-2409
1234!";	-2410
Connect	-2411
LIMITED	-2412
▁report	-2413
READMODE	-2414
INSTANCES	-2415
UNLIMITED	-2416
Second	-2417
fputc	-2418
fputs	-2419
fprintf	-2420
putchar	-2421
Properties	-2422
NamedPipeClient	-2423
CryptDecrypt	-2424
Message	-2425
▁dBConnection	-2426
side	-2427
Windo	-2428
AsUser	-2429
Window	-2430
WindowStation	-2431
ach	-2432
▁sure	-2433
▁linked	-2434
dent	-2435
▁system	-2436
▁2;	-2437
▁Un	-2438
aw	-2439
oom	-2440
▁raw	-2441
▁room	-2442
IntClass	-2443
Wh	-2444
)),	-2445
err	-2446
123_	-2447
What	-2448
Where	-2449
Write	-2450
-8")),	-2451
DECRYPT	-2452
aesCipher	-2453
▁temporary	-2454
ABCDEFGHABCDEFGH	-2455
(0,	-2456
oft	-2457
ros	-2458
ates	-2459
icros	-2460
icrosoft	-2461
▁SecureRandom	-2462
Win	-2463
▁NOTE	-2464
Variable	-2465
)(100	-2466
▁these	-2467
GSource	-2468
▁si	-2469
ha	-2470
Beha	-2471
vior	-2472
Behavior	-2473
75	-2474
758_	-2475
(-1);	-2476
(-1);}	-2477
Undefined	-2478
▁initialized	-2479
CreateNamedPipe	-2480
▁Ass	-2481
▁Assign	-2482
▁because	-2483
CryptEncrypt	-2484
▁TRUE	-2485
inputBuffer	-2486
▁id	-2487
▁badStruct	-2488
.\\	-2489
[0].	-2490
▁dataHashMap	-2491
▁dataLinkedList	-2492
Global	-2493
Executable	-2494
environment	-2495
▁Ch	-2496
▁Check	-2497
▁printLong	-2498
getC	-2499
▁query	-2500
▁token	-2501
Sources	-2502
getQuery	-2503
Tokenizer	-2504
getCookies	-2505
getParameter	-2506
getQueryString	-2507
*)(	-2508
▁opened	-2509
ee	-2510
buf	-2511
▁inet	-2512
▁append	-2513
▁getConnection	-2514
▁executable	-2515
fin	-2516
final	-2517
▁ident	-2518
▁reads	-2519
▁identify	-2520
leared	-2521
Unsigned	-2522
(1,	-2523
Oper	-2524
malloc	-2525
table	-2526
HK	-2527
wc	-2528
680	-2529
INF	-2530
ION	-2531
SRC	-2532
680_	-2533
ainer	-2534
▁Wait	-2535
▁hUser	-2536
▁hMutex	-2537
CloseKey	-2538
hProcess	-2539
Connected	-2540
Container	-2541
WinStation	-2542
▁ByteArray	-2543
▁fConnected	-2544
▁RegCloseKey	-2545
▁y	-2546
uncPtr	-2547
▁result	-2548
4);	-2549
▁you	-2550
(3954	-2551
▁3954	-2552
accept	-2553
(39543);	-2554
listener	-2555
▁39544);	-2556
FileInputStream	-2557
1:	-2558
NG	-2559
-32	-2560
▁WE	-2561
-321:	-2562
▁WEOF	-2563
▁Cryptographic	-2564
321_	-2565
▁Reading	-2566
▁toBeDecrypted	-2567
▁zero	-2568
GSink	-2569
Public	-2570
129_	-2571
▁thing	-2572
PublicStatic	-2573
22	-2574
nd	-2575
\\\\	-2576
goodB	-2577
writer	-2578
\\\\.\\	-2579
gor	-2580
ithm	-2581
▁algor	-2582
Missing	-2583
▁number	-2584
supported	-2585
▁algorithm	-2586
▁writerBuffered	-2587
▁(5	-2588
privateFive	-2589
Chars	-2590
256_	-2591
(*	-2592
pc	-2593
www	-2594
Number	-2595
OOL	-2596
▁BOOL	-2597
ance	-2598
ately	-2599
false	-2600
▁loop	-2601
DES	-2602
▁gener	-2603
key	-2604
hMutex	-2605
wcs	-2606
ML	-2607
TML	-2608
")).	-2609
▁web	-2610
/")).	-2611
▁HTML	-2612
▁body	-2613
▁writ	-2614
▁server	-2615
openConnection	-2616
▁urlConnection	-2617
▁CRYPT	-2618
Fa	-2619
decl	-2620
declare	-2621
AAAAAAAA	-2622
ust	-2623
wcslen	-2624
).	-2625
0;	-2626
ose	-2627
ms	-2628
we	-2629
Ldap	-2630
▁ldap	-2631
alloca	-2632
verted	-2633
Success	-2634
pMessage	-2635
principal	-2636
vertedText	-2637
▁requiredSize	-2638
LdapConnection	-2639
▁convertedText	-2640
trol	-2641
BytesLine	-2642
HCRYPTHASH	-2643
▁printBytesLine	-2644
USE	-2645
▁NMP	-2646
▁NMPWAIT	-2647
NEW	-2648
mat	-2649
325_	-2650
Step	-2651
Required	-2652
▁secureRandom	-2653
(0)	-2654
▁cout	-2655
iven	-2656
▁Hex	-2657
▁hex	-2658
[(100	-2659
▁Wipe	-2660
▁back	-2661
Format	-2662
decode	-2663
▁given	-2664
codeHex	-2665
▁decodeHex	-2666
istd	-2667
unistd	-2668
_22_	-2669
▁host	-2670
▁per	-2671
MOV	-2672
env	-2673
MOVE	-2674
REMOVE	-2675
▁possibly	-2676
RegOpenUSKey	-2677
liance	-2678
fort	-2679
ools	-2680
▁fut	-2681
fortun	-2682
▁Tools	-2683
▁those	-2684
▁future	-2685
▁Unfortun	-2686
▁Unfortunately	-2687
[2	-2688
▁ass	-2689
▁Hardcoded	-2690
▁newDirectory	-2691
▁type	-2692
wprintf	-2693
ToRead	-2694
version	-2695
Inside	-2696
pa	-2697
pes	-2698
arpa	-2699
types	-2700
netinet	-2701
▁");	-2702
HKCU	-2703
spec	-2704
▁contain	-2705
_8	-2706
ORM	-2707
AAAAAAAAAA	-2708
▁Container	-2709
▁7:	-2710
▁writing	-2711
▁1024	-2712
▁contains	-2713
-5	-2714
-512	-2715
32")	-2716
▁privateFive	-2717
rd	-2718
▁variables	-2719
kerberosKey	-2720
passwordAuth	-2721
driverManager	-2722
supportedOper	-2723
BufferedWriter	-2724
▁};	-2725
filename	-2726
stdin	-2727
NO	-2728
Unc	-2729
▁put	-2730
oi	-2731
226_	-2732
Before	-2733
roperly	-2734
Uncleared	-2735
▁:	-2736
etL	-2737
▁atoi	-2738
etLast	-2739
▁Convert	-2740
etLastError	-2741
SecretKeySpec	-2742
Security	-2743
▁attempting	-2744
Type	-2745
▁Using	-2746
pcImpersonate	-2747
▁tr	-2748
▁Properly	-2749
32"	-2750
Cre	-2751
▁decl	-2752
▁declared	-2753
▁3	-2754
▁Good	-2755
OP	-2756
ANCED	-2757
ENHANCED	-2758
▁cryptoKeyBuffer	-2759
_22	-2760
ality	-2761
)'	-2762
myp	-2763
pus	-2764
▁*;	-2765
back	-2766
push	-2767
▁HUS	-2768
OCESS	-2769
REGSET	-2770
mypipe	-2771
▁SHReg	-2772
▁HUSKEY	-2773
▁SHREGSET	-2774
CloseUSKey	-2775
▁RegCreate	-2776
▁CreateMutex	-2777
▁intUnsigned	-2778
serviceClient	-2779
▁SHRegCloseUSKey	-2780
OS	-2781
)-1	-2782
_33	-2783
_33;	-2784
(5)	-2785
▁&)	-2786
tion	-2787
▁causes	-2788
ASS	-2789
▁PASS	-2790
▁PASSWORD	-2791
gr	-2792
gram	-2793
▁PUT	-2794
▁control	-2795
▁intArray	-2796
▁information	-2797
▁initialization	-2798
ol	-2799
▁possible	-2800
lv	-2801
lvl	-2802
10))	-2803
▁Out	-2804
IPHER	-2805
▁(10))	-2806
Private	-2807
intArray	-2808
relative	-2809
▁validate	-2810
▁secretKey	-2811
relativePath	-2812
▁OutputStream	-2813
▁BufferedWriter	-2814
37	-2815
sh	-2816
comm	-2817
ypic	-2818
47	-2819
lw	-2820
api	-2821
244_	-2822
free	-2823
shlw	-2824
domain	-2825
▁(-1),	-2826
Inspect	-2827
shlwapi	-2828
Inspection	-2829
CreateMutex	-2830
digest	-2831
▁des	-2832
963	-2833
964	-2834
_04	-2835
_05	-2836
_06	-2837
_07	-2838
_08	-2839
_09	-2840
_14	-2841
_15	-2842
ived	-2843
123456"	-2844
_16	-2845
_17	-2846
OneIntClass	-2847
▁Did	-2848
Token	-2849
eryst	-2850
LSocket	-2851
database	-2852
▁cookies	-2853
▁queryst	-2854
▁tokenizer	-2855
Environment	-2856
▁querystring	-2857
▁getParameter	-2858
PropertiesFile	-2859
▁cookieSources	-2860
▁StringTokenizer	-2861
../	-2862
eve	-2863
("../	-2864
rieve	-2865
common	-2866
config	-2867
▁retrieve	-2868
tting	-2869
▁encrypt	-2870
▁setting	-2871
privateTrue	-2872
EC	-2873
App	-2874
ati	-2875
lati	-2876
vely	-2877
▁20;	-2878
GoodApp	-2879
Program	-2880
▁relati	-2881
▁PAYLOAD	-2882
▁typedef	-2883
▁relatively	-2884
Po	-2885
398_	-2886
Code	-2887
Poor	-2888
▁inc	-2889
ayout	-2890
Quality	-2891
>();	-2892
_81_	-2893
▁base	-2894
Serial	-2895
▁Vector	-2896
▁serial	-2897
▁HashMap	-2898
Serialized	-2899
▁LinkedList	-2900
▁baseObject	-2901
(5!=5)	-2902
globalFalse	-2903
alt	-2904
▁7;	-2905
▁two	-2906
▁intVariable	-2907
▁V	-2908
_45_	-2909
▁lines	-2910
▁thread	-2911
▁conversion	-2912
BData	-2913
')	-2914
\"	-2915
lag	-2916
Temp	-2917
▁flag	-2918
nextInt	-2919
ENCRYPT	-2920
number	-2921
USERNAME	-2922
Fact	-2923
Factory	-2924
ild	-2925
ual	-2926
uble	-2927
00,	-2928
CTE	-2929
DUP	-2930
LEX	-2931
CTED	-2932
CONNE	-2933
DUPLEX	-2934
CharInt	-2935
▁Connect	-2936
CONNECTED	-2937
EW	-2938
▁ac	-2939
▁NEW	-2940
▁Try	-2941
KEYSET	-2942
▁acqui	-2943
▁Hashed	-2944
NEWKEYSET	-2945
▁creating	-2946
▁acquiring	-2947
▁CryptDeriveKey	-2948
.1	-2949
.1"	-2950
127	-2951
.0.0	-2952
▁"127	-2953
system	-2954
.0.0.1"	-2955
▁"127.0.0.1"	-2956
INE	-2957
LOC	-2958
eld	-2959
MACH	-2960
LOCAL	-2961
MACHINE	-2962
ToEncrypt	-2963
7)	-2964
▁strncpy	-2965
▁field	-2966
▁fscanf	-2967
▁dr	-2968
▁drive	-2969
▁search	-2970
1234!");	-2971
ServerSocket	-2972
icode	-2973
eth	-2974
oth	-2975
ethod	-2976
▁both	-2977
▁invalid	-2978
RegCreateKey	-2979
RegOpenKeyEx	-2980
SHRegOpenUSKey	-2981
▁.	-2982
▁x	-2983
The	-2984
otent	-2985
▁method	-2986
Signed	-2987
▁bytesToRead	-2988
ference	-2989
ACP	-2990
ECK	-2991
Mul	-2992
▁WC	-2993
COMP	-2994
▁-1,	-2995
CHECK	-2996
Multi	-2997
OSITE	-2998
other	-2999
▁Wide	-3000
CharTo	-3001
▁stack	-3002
▁another	-3003
COMPOSITE	-3004
MultiByte	-3005
▁WideCharTo	-3006
▁staticFive	-3007
▁staticTrue	-3008
▁staticFalse	-3009
COMPOSITECHECK	-3010
▁(*	-3011
arse	-3012
▁Cookie	-3013
▁client	-3014
_43	-3015
00,0	-3016
_43;	-3017
▁blocks	-3018
ident	-3019
Thread	-3020
▁incident	-3021
▁CreateFile	-3022
▁don	-3023
create	-3024
-512");	-3025
sl	-3026
long	-3027
▁ssl	-3028
)(100-	-3029
▁hence	-3030
4".	-3031
lus	-3032
mul	-3033
sty	-3034
tot	-3035
▁*>	-3036
▁32	-3037
▁But	-3038
▁fol	-3039
style	-3040
▁WHAT	-3041
▁away	-3042
▁mach	-3043
▁plus	-3044
▁well	-3045
lowing	-3046
ypical	-3047
▁WHERE	-3048
▁simul	-3049
because	-3050
▁protot	-3051
spective	-3052
▁Because	-3053
▁removes	-3054
▁machines	-3055
▁Microsoft	-3056
▁following	-3057
▁insertion	-3058
▁simulates	-3059
▁perspective	-3060
▁prototypical	-3061
MAX	-3062
_51	-3063
_52	-3064
_53	-3065
_54	-3066
_66	-3067
_67	-3068
_68	-3069
UnsupportedOper	-3070
pty	-3071
empty	-3072
wincrypt	-3073
▁GET	-3074
LENAME	-3075
▁their	-3076
▁GETENV	-3077
passwords	-3078
RpcImpersonate	-3079
ImpersonateSelf	-3080
-7	-3081
98	-3082
ssw	-3083
-798	-3084
▁war	-3085
▁warning	-3086
getPassword	-3087
▁Credentials	-3088
▁owner	-3089
FormatException	-3090
LL	-3091
▁must	-3092
library	-3093
Generic	-3094
▁<=	-3095
▁wcsncpy	-3096
_74	-3097
Cookie	-3098
hostInfo	-3099
▁"\\\\.\\	-3100
its	-3101
ntil	-3102
▁bits	-3103
▁until	-3104
exception	-3105
wb	-3106
stead	-3107
▁double	-3108
▁instead	-3109
▁passwordVector	-3110
▁strncat	-3111
▁wcsncat	-3112
▁privateTrue	-3113
Reliance	-3114
▁pointers	-3115
▁overwrite	-3116
▁undefined	-3117
▁privateFalse	-3118
_01	-3119
URL	-3120
swscanf	-3121
vParameter	-3122
vParameterSpec	-3123
▁dataArray	-3124
▁dataContainer	-3125
setW	-3126
setRead	-3127
▁Readable	-3128
▁Writable	-3129
setReadable	-3130
setWritable	-3131
▁Executable	-3132
setExecutable	-3133
_72	-3134
_73	-3135
Catch	-3136
29	-3137
VS	-3138
dn	-3139
px	-3140
29.	-3141
Bro	-3142
_62	-3143
.100	-3144
327_	-3145
_62;	-3146
aspx	-3147
msdn	-3148
wewb	-3149
▁().	-3150
▁See	-3151
▁Vis	-3152
▁ent	-3153
▁http	-3154
Broken	-3155
Crypto	-3156
▁Visual	-3157
▁compile	-3158
microsoft	-3159
initialize	-3160
▁generates	-3161
mand	-3162
▁give	-3163
▁enter	-3164
▁command	-3165
▁specify	-3166
▁assigned	-3167
▁methods	-3168
TI	-3169
VO	-3170
si	-3171
"),	-3172
.*/	-3173
2",	-3174
ART	-3175
NON	-3176
OLD	-3177
OPT	-3178
▁pi	-3179
)-1,	-3180
,100	-3181
ForS	-3182
INFO	-3183
LATI	-3184
ktop	-3185
otes	-3186
urro	-3187
▁REG	-3188
,100-	-3189
ARTUP	-3190
ATION	-3191
hDesk	-3192
hFile	-3193
ingle	-3194
putwc	-3195
▁step	-3196
FINITE	-3197
INFORM	-3198
LATILE	-3199
OPTION	-3200
Please	-3201
stdout	-3202
▁Files	-3203
▁child	-3204
▁exits	-3205
▁hDesk	-3206
▁hFile	-3207
▁surro	-3208
Example	-3209
PAYLOAD	-3210
hThread	-3211
▁quotes	-3212
VOLATILE	-3213
ktopName	-3214
removeme	-3215
username	-3216
▁PROCESS	-3217
▁STARTUP	-3218
▁handles	-3219
)(100-1),	-3220
ForSingle	-3221
HCRYPTKEY	-3222
▁INFINITE	-3223
▁fileName	-3224
▁wStation	-3225
HCRYPTPROV	-3226
INFORMATION	-3227
hWinStation	-3228
▁successful	-3229
GetLastError	-3230
▁STARTUPINFO	-3231
▁commandLine	-3232
▁desktopName	-3233
▁hWinStation	-3234
▁wStationName	-3235
▁CreateDesktop	-3236
▁CreateProcess	-3237
▁WaitForSingle	-3238
▁RegCreateKeyEx	-3239
adding	-3240
funcPtr	-3241
▁funcPtr	-3242
)*/	-3243
CreateFile	-3244
toBeDecryptedLen	-3245
co	-3246
thing	-3247
_71	-3248
_75	-3249
ior	-3250
▁(3	-3251
▁2)	-3252
▁Clear	-3253
▁prior	-3254
tainerOne	-3255
▁PrintWriter	-3256
(""	-3257
88_	-3258
Dir	-3259
gener	-3260
ateKey	-3261
▁"1234	-3262
TempFile	-3263
byteArray	-3264
▁SecretKey	-3265
generateKey	-3266
createTempFile	-3267
streamFileOutput	-3268
▁SS	-3269
sert	-3270
▁end	-3271
_02	-3272
_03	-3273
_11	-3274
_13	-3275
_12	-3276
OfBytes	-3277
OfBytesRead	-3278
sub	-3279
++;	-3280
mic	-3281
badSource	-3282
erator	-3283
▁clear	-3284
()));	-3285
nel	-3286
annel	-3287
▁channel	-3288
[2]	-3289
▁Encrypt	-3290
payloadLen	-3291
95	-3292
9580	-3293
ially	-3294
otentially	-3295
▁lit	-3296
unionFirst	-3297
unionSecond	-3298
SecureRandom	-3299
23	-3300
ually	-3301
itialization	-3302
42	-3303
_18	-3304
32_0	-3305
PF	-3306
_34_	-3307
▁pre	-3308
▁bind	-3309
LISTEN	-3310
ds	-3311
[10]	-3312
dsAs	-3313
▁ind	-3314
edCre	-3315
ilter	-3316
▁PUTS	-3317
▁viol	-3318
▁REMOVE	-3319
▁RENAME	-3320
dsAsBytes	-3321
▁privilege	-3322
▁unionType	-3323
▁violating	-3324
edCredsAsBytes	-3325
pLdapConnection	-3326
▁pLdapConnection	-3327
▁fis	-3328
123456";	-3329
systemProperty	-3330
_31	-3331
_45	-3332
▁Possibly	-3333
▁printLongLine	-3334
WChars	-3335
getenv	-3336
▁LogonUserA	-3337
▁LogonUserW	-3338
newDirectory	-3339
▁decodeHexChars	-3340
▁decodeHexWChars	-3341
On	-3342
396_	-3343
_41_	-3344
▁cryptoKeyLen	-3345
▁Bad	-3346
With	-3347
mpData	-3348
▁fwrite	-3349
▁badData	-3350
▁GoodSink	-3351
▁functions	-3352
goodfilename	-3353
▁CryptEncrypt	-3354
"\\\\.\\	-3355
1");	-3356
2");	-3357
very	-3358
▁tmpData	-3359
ereference	-3360
76_	-3361
ff	-3362
ech	-3363
exe	-3364
PUTS	-3365
▁eff	-3366
RENAME	-3367
fputwc	-3368
fputws	-3369
▁100-1	-3370
fwscanf	-3371
▁effect	-3372
SNPRINTF	-3373
fwprintf	-3374
putwchar	-3375
▁realloc	-3376
▁Exception	-3377
TR	-3378
Exit	-3379
arge	-3380
large	-3381
▁1);	-3382
btain	-3383
sent	-3384
▁badStatic	-3385
▁directory	-3386
gn	-3387
erous	-3388
gnore	-3389
▁100);	-3390
▁Number	-3391
angerous	-3392
▁Write	-3393
ke	-3394
like	-3395
▁*)(	-3396
▁1),	-3397
▁One	-3398
▁classOne	-3399
▁OneIntClass	-3400
▁Imp	-3401
▁Impersonate	-3402
▁incidentals	-3403
▁insecure	-3404
▁DO	-3405
start	-3406
▁SSLSocket	-3407
▁dataGoodG	-3408
ARI	-3409
▁IV	-3410
00];	-3411
ABLE	-3412
VARI	-3413
[5];	-3414
▁der	-3415
puter	-3416
[200];	-3417
VARIABLE	-3418
▁derived	-3419
▁padding	-3420
▁charBuffer	-3421
encryptedLen	-3422
toBeEncrypted	-3423
OK	-3424
PC	-3425
BUF	-3426
▁(0	-3427
etwe	-3428
▁2),	-3429
▁RPC	-3430
▁cin	-3431
BUFFER	-3432
ToSelf	-3433
client	-3434
etween	-3435
Imperson	-3436
▁between	-3437
badStruct	-3438
vertToSelf	-3439
▁WSAStartup	-3440
CreateProcessA	-3441
▁serviceClient	-3442
angu	-3443
used	-3444
▁every	-3445
▁langu	-3446
▁language	-3447
▁(6)	-3448
dBConnection	-3449
16	-3450
▁hostname	-3451
5.	-3452
8.	-3453
("19	-3454
105.	-3455
168.	-3456
23",	-3457
("192.	-3458
105.23",	-3459
▁FILENAME	-3460
▁anything	-3461
("192.168.	-3462
["	-3463
kd	-3464
128	-3465
395	-3466
▁"]	-3467
kdir	-3468
getEn	-3469
▁PRNG	-3470
▁line	-3471
CIPHER	-3472
▁Input	-3473
▁exist	-3474
byteKey	-3475
▁CIPHER	-3476
▁intOne	-3477
▁byteKey	-3478
hashValue	-3479
▁"1234");	-3480
getEncoded	-3481
▁hashValue	-3482
▁directoryName	-3483
kip	-3484
append	-3485
LD	-3486
Dro	-3487
lev	-3488
old	-3489
188_	-3490
273_	-3491
pped	-3492
▁OLD	-3493
Relev	-3494
Layout	-3495
Search	-3496
▁(100-	-3497
Dropped	-3498
realloc	-3499
▁rename	-3500
Privileg	-3501
Relevant	-3502
▁clearing	-3503
Privileges	-3504
badfilename	-3505
CreateDesktop	-3506
▁like	-3507
SO	-3508
0\\	-3509
961	-3510
9644	-3511
9580\\	-3512
9640\\	-3513
▁users	-3514
▁where	-3515
uncated	-3516
ResultSet	-3517
=0	-3518
Tr	-3519
We	-3520
ATH	-3521
asM	-3522
tle	-3523
▁"&	-3524
(3);	-3525
="))	-3526
PATH	-3527
hasM	-3528
▁ADD	-3529
▁SQL	-3530
▁buf	-3531
▁equ	-3532
▁isr	-3533
=0");	-3534
sWith	-3535
token	-3536
▁then	-3537
Tokens	-3538
cookie	-3539
▁"&");	-3540
▁Parse	-3541
▁param	-3542
▁setup	-3543
hasMore	-3544
▁little	-3545
Resource	-3546
getValue	-3547
▁execute	-3548
▁prepare	-3549
getString	-3550
hardcoded	-3551
nextToken	-3552
substring	-3553
tokenizer	-3554
▁buffread	-3555
startsWith	-3556
▁resultset	-3557
cookieSources	-3558
hasMoreTokens	-3559
StringTokenizer	-3560
:"	-3561
sed	-3562
▁":"	-3563
▁pas	-3564
getUser	-3565
▁passed	-3566
getUserName	-3567
▁200	-3568
▁DOMAIN	-3569
snwprintf	-3570
StructLine	-3571
dataVector	-3572
▁printStructLine	-3573
(5);	-3574
ization	-3575
>(5);	-3576
action	-3577
▁serialize	-3578
toByteArray	-3579
writeObject	-3580
containerOne	-3581
outputObject	-3582
▁ObjectOutput	-3583
▁serialization	-3584
nic	-3585
echnic	-3586
echnically	-3587
▁GoodSource	-3588
▁structCharInt	-3589
local	-3590
eroize	-3591
▁allows	-3592
8)	-3593
176_	-3594
Enco	-3595
Hand	-3596
ling	-3597
Unicode	-3598
Encoding	-3599
Handling	-3600
▁All	-3601
unding	-3602
▁steps	-3603
▁100-1)	-3604
Creation	-3605
Insecure	-3606
▁present	-3607
▁release	-3608
removemegood	-3609
▁surrounding	-3610
ln	-3611
println	-3612
88	-3613
IB	-3614
ISO	-3615
NSI	-3616
UTE	-3617
(128	-3618
ATTR	-3619
NORM	-3620
hrow	-3621
▁188	-3622
▁Per	-3623
▁fri	-3624
IBUTE	-3625
▁ANSI	-3626
▁rece	-3627
(128);	-3628
NORMAL	-3629
▁cipher	-3630
▁layout	-3631
▁Perform	-3632
▁friends	-3633
ATTRIBUTE	-3634
▁received	-3635
▁reliance	-3636
non	-3637
▁SE	-3638
getWriter	-3639
▁skip	-3640
▁strong	-3641
classTwo	-3642
▁overread	-3643
▁printing	-3644
NumberFormat	-3645
▁errorString	-3646
▁(7)	-3647
ently	-3648
▁puts	-3649
herently	-3650
CipherText	-3651
StringToEncrypt	-3652
▁stringToEncrypt	-3653
▁global	-3654
(7)	-3655
ssl	-3656
▁mi	-3657
▁sn	-3658
mics	-3659
▁family	-3660
▁mimics	-3661
SSLSocket	-3662
▁snprintf	-3663
▁badPrivate	-3664
▁badPublicStatic	-3665
315_	-3666
+1];	-3667
ious	-3668
MessageDigest	-3669
▁passwordCopy	-3670
.)	-3671
fi	-3672
▁generic	-3673
ONG	-3674
_41	-3675
msg	-3676
▁UL	-3677
32_1	-3678
[256	-3679
search	-3680
▁ULONG	-3681
HexChar	-3682
jection	-3683
msgfree	-3684
▁PUTENV	-3685
▁filter	-3686
▁fprintf	-3687
▁results	-3688
charFirst	-3689
▁intSigned	-3690
HexCharLine	-3691
structCharInt	-3692
▁CreateMutexA	-3693
▁CreateMutexW	-3694
▁searchSuccess	-3695
▁connectSuccess	-3696
▁passwordHashMap	-3697
20	-3698
▁";	-3699
ABCD	-3700
▁endl	-3701
1234!"	-3702
▁perform	-3703
be	-3704
_21	-3705
beg	-3706
▁::	-3707
begin	-3708
▁ssls	-3709
iterator	-3710
▁sslSocket	-3711
▁longNumber	-3712
▁sslsSocket	-3713
▁GetLastError	-3714
_32	-3715
_42	-3716
_44	-3717
▁each	-3718
▁just	-3719
▁Catch	-3720
Dou	-3721
ider	-3722
mkdir	-3723
Double	-3724
▁failure	-3725
"\\	-3726
_34	-3727
dot	-3728
ran	-3729
ches	-3730
▁5!=5	-3731
▁5==5	-3732
▁bran	-3733
▁CRYPTO	-3734
▁unicode	-3735
▁branches	-3736
privateFalse	-3737
pports	-3738
▁readable	-3739
▁supports	-3740
▁writable	-3741
▁potentially	-3742
ARCH	-3743
▁SEARCH	-3744
(100);	-3745
▁Insert	-3746
▁getenv	-3747
▁need	-3748
passwordVector	-3749
▁equal	-3750
Dangerous	-3751
▁passwordArray	-3752
32();	-3753
▁RAND	-3754
0_	-3755
dataArray	-3756
dataHashMap	-3757
dataContainer	-3758
dataLinkedList	-3759
dataSerialized	-3760
▁dataSerialized	-3761
*/	-3762
Ad	-3763
py	-3764
tc	-3765
3";	-3766
ans	-3767
not	-3768
▁"7	-3769
sues	-3770
ision	-3771
▁copy	-3772
▁cannot	-3773
▁issues	-3774
▁charFirst	-3775
▁truncated	-3776
ERT	-3777
omp	-3778
390_	-3779
▁ASS	-3780
Action	-3781
Without	-3782
▁ASSERT	-3783
ght	-3784
▁fig	-3785
aught	-3786
Attempt	-3787
▁define	-3788
▁figure	-3789
▁defined	-3790
MD	-3791
fI	-3792
▁!	-3793
▁9	-3794
ACH	-3795
ARE	-3796
Off	-3797
STA	-3798
Sub	-3799
Way	-3800
etc	-3801
the	-3802
▁ag	-3803
328_	-3804
DESK	-3805
DEST	-3806
PRNG	-3807
ible	-3808
▁(32	-3809
▁*)"	-3810
▁259	-3811
▁CRE	-3812
▁DET	-3813
▁etc	-3814
ACHED	-3815
SHARE	-3816
▁HWIN	-3817
▁fact	-3818
▁rand	-3819
Revers	-3820
ToHash	-3821
result	-3822
▁HDESK	-3823
▁again	-3824
▁chars	-3825
▁wants	-3826
Nothing	-3827
PROCESS	-3828
fIgnore	-3829
▁CREATE	-3830
▁HWINSTA	-3831
▁RegOpen	-3832
▁Station	-3833
▁station	-3834
Substring	-3835
▁DETACHED	-3836
▁creation	-3837
Reversible	-3838
▁Establish	-3839
fIgnoreHKCU	-3840
▁CreateFileA	-3841
▁CreateFileW	-3842
▁stringHello	-3843
▁technically	-3844
Impersonation	-3845
▁CloseDesktop	-3846
▁RegCreateKey	-3847
▁RegOpenKeyEx	-3848
▁RevertToSelf	-3849
▁STARTUPINFOA	-3850
▁STARTUPINFOW	-3851
DesktopExample	-3852
Initialization	-3853
StationExample	-3854
WindowStationA	-3855
WindowStationW	-3856
RegCreateKeyExA	-3857
RegCreateKeyExW	-3858
RegCreateUSKeyA	-3859
RegCreateUSKeyW	-3860
newgoodfilename	-3861
▁CreateDesktopA	-3862
▁CreateDesktopW	-3863
▁SHRegOpenUSKey	-3864
▁RegCreateKeyExA	-3865
▁RegCreateKeyExW	-3866
Ent	-3867
Enter	-3868
▁vector	-3869
38	-3870
rb	-3871
99]	-3872
)-1;	-3873
[99]	-3874
_01;	-3875
_21_	-3876
_31_	-3877
_32_	-3878
_42_	-3879
_44_	-3880
place	-3881
▁100)	-3882
▁match	-3883
cryption	-3884
▁Cleanup	-3885
placement	-3886
terminated	-3887
▁decryption	-3888
▁passwordMap	-3889
▁passwordList	-3890
mo	-3891
337	-3892
32_3	-3893
ivid	-3894
mote	-3895
▁sen	-3896
337);	-3897
parse	-3898
Caught	-3899
remote	-3900
▁1337);	-3901
parseInt	-3902
▁Integer	-3903
▁individ	-3904
▁sending	-3905
addCookie	-3906
▁individually	-3907
getOutputStream	-3908
("/	-3909
(42	-3910
esn	-3911
tex	-3912
upd	-3913
379_	-3914
verw	-3915
▁Ret	-3916
(42);	-3917
andne	-3918
bytes	-3919
doesn	-3920
▁Will	-3921
395");	-3922
OnExit	-3923
texist	-3924
update	-3925
▁1024;	-3926
verwill	-3927
▁create	-3928
Successf	-3929
▁Rethrow	-3930
▁opening	-3931
secureDir	-3932
testcases	-3933
Successful	-3934
▁byteArray	-3935
bytesToRead	-3936
doesntexist	-3937
andneverwill	-3938
▁StringBuffer	-3939
writerBuffered	-3940
▁IvParameterSpec	-3941
▁UnsupportedOper	-3942
▁ivParameterSpec	-3943
Advapi	-3944
-512)	-3945
▁would	-3946
▁(5==5)	-3947
▁bounds	-3948
▁intFive	-3949
▁X	-3950
▁10)	-3951
act	-3952
▁badGlobal	-3953
stde	-3954
badData	-3955
stdexcept	-3956
▁swprintf	-3957
KerberosKey	-3958
linkedListNext	-3959
linkedListPrev	-3960
▁auth	-3961
▁secure	-3962
▁authentication	-3963
_02;	-3964
_03;	-3965
_04;	-3966
_05;	-3967
_06;	-3968
_07;	-3969
_08;	-3970
_09;	-3971
_10;	-3972
_11;	-3973
_12;	-3974
_13;	-3975
_14;	-3976
_15;	-3977
_16;	-3978
_17;	-3979
_18;	-3980
Is	-3981
My	-3982
NS	-3983
MyS	-3984
sue	-3985
This	-3986
salt	-3987
IsMyS	-3988
avoid	-3989
odify	-3990
reset	-3991
▁561:	-3992
▁dead	-3993
▁iter	-3994
▁salt	-3995
▁issue	-3996
IsMySalt	-3997
Username	-3998
avoidable	-3999
▁iteration	-4000
intVariable	-4001
ThisIsMySalt	-4002
▁Missing	-4003
▁cleared	-4004
▁Dereference	-4005
BP	-4006
mit	-4007
▁-1)	-4008
(100-	-4009
ansmit	-4010
▁Obtain	-4011
ansmitted	-4012
unionType	-4013
▁encryption	-4014
▁transmitted	-4015
(0);	-4016
iple	-4017
▁DES	-4018
iostream	-4019
▁intSecond	-4020
▁RpcImpersonate	-4021
▁ImpersonateSelf	-4022
PEN	-4023
send	-4024
fixed	-4025
